// Bài toán ép kiểu
// var a = 20;
// var b = '10';
// console.log(a + b);

//juh
// --------------------------------------------------------------------------------------------------------------------

// Phép tăng
// var count = 0;
// count++;
// ++count;
// // tiền tố hậu tố
// console.log(`Count = ${count}`);

// --------------------------------------------------------------------------------------------------------------------

// Phép giảm
// var count = 10;
// count--;
// console.log(`Count = ${count}`);

// var count = 1;
// var total = count++ + ++count;
/*
count = 0; total = 0;
count = 1; total = 1;
count = 2; total = 1 + 1 = 2;
count = 3; total = 2 + 2 = 4;
*/
// console.log(count);

// --------------------------------------------------------------------------------------------------------------------
